MYiR-Dev/myir-imx-linux/drivers/staging/rtl8733bu/core/rtw_ft.c
	passoc_sta_evt = \
			(struct stassoc_event *)(pevtcmd + \
			sizeof(struct rtw_evt_header));
	_rtw_memcpy((unsigned char *)(&(passoc_sta_evt->macaddr)),
			pMacAddr, ETH_ALEN);
	rtw_enqueue_cmd(pcmdpriv, pcmd_obj);
}

void rtw_ft_link_timer_hdl(void *ctx)
{
	_adapter *padapter = (_adapter *)ctx;
	struct mlme_ext_priv *pmlmeext = &(padapter->mlmeextpriv);
	struct mlme_ext_info *pmlmeinfo = &(pmlmeext->mlmext_info);
	struct mlme_priv *pmlmepriv = &(padapter->mlmepriv);
	struct ft_roam_info *pft_roam = &(pmlmepriv->ft_roam);

	if (rtw_ft_chk_status(padapter, RTW_FT_REQUESTING_STA)) {

		if (pmlmepriv->roam_network)
			pmlmepriv->roam_buf_pkt = 1;

		if (pft_roam->ft_req_retry_cnt < RTW_FT_ACTION_REQ_LMT) {
			pft_roam->ft_req_retry_cnt++;
			rtw_ft_issue_action_req(padapter,
			(u8 *)pmlmepriv->roam_network->network.MacAddress);
			_set_timer(&pmlmeext->ft_link_timer, REASSOC_TO);
		} else {
			pft_roam->ft_req_retry_cnt = 0;
			if (pmlmeinfo->state & WIFI_FW_ASSOC_SUCCESS) {
				rtw_ft_set_status(padapter,
					RTW_FT_ASSOCIATED_STA);
			} else
				rtw_ft_reset_status(padapter);
		}
	}
}

void rtw_ft_roam_timer_hdl(void *ctx)
{
	_adapter *padapter = (_adapter *)ctx;
	struct mlme_priv *pmlmepriv = &(padapter->mlmepriv);

	RTW_FT_INFO("%s : try roaming\n", __func__);
	receive_disconnect(padapter,
			pmlmepriv->cur_network.network.MacAddress,
			WLAN_REASON_ACTIVE_ROAM, _FALSE);
}

void rtw_ft_roam_status_reset(_adapter *padapter)
{
	struct ft_roam_info *pft_roam = &(padapter->mlmepriv.ft_roam);

	if ((rtw_to_roam(padapter) > 0) &&
		(!rtw_ft_chk_status(padapter, RTW_FT_REQUESTED_STA))) {
		rtw_ft_reset_status(padapter);
	}

	padapter->mlmepriv.ft_roam.ft_updated_bcn = _FALSE;
}

void rtw_ft_peer_info_init(struct sta_info *psta)
{
	struct rtw_sta_ft_info_t *peer = &(psta->ft_peer);
	_rtw_memset(peer, 0, sizeof(struct rtw_sta_ft_info_t));
}

void rtw_ft_peer_info_free(struct sta_info *psta)
{
	struct rtw_sta_ft_info_t *peer = &(psta->ft_peer);

	rtw_buf_free(&peer->md_ie, &peer->md_len);
	rtw_buf_free(&peer->rsn_ie, &peer->rsn_len);
	rtw_buf_free(&peer->ft_ie, &peer->ft_len);
}

#ifdef CONFIG_RTW_80211R_AP
int rtw_ft_update_sta_ies(_adapter *padapter,
	struct cfg80211_update_ft_ies_params *ie)
{
	struct security_priv *psecuritypriv = &(padapter->securitypriv);
	struct sta_priv *pstapriv = &(padapter->stapriv);
	struct sta_info *psta;
	struct rtw_sta_ft_info_t *peer_info;
	u8 *ptr, *paddr;
	u32 len;
	int ret = 0;

	if (!CHECK_BIT(WLAN_AKM_TYPE_FT_PSK, psecuritypriv->akmp)
		&& !CHECK_BIT(WLAN_AKM_TYPE_FT_8021X, psecuritypriv->akmp)
		&& !CHECK_BIT(WLAN_AKM_TYPE_FT_OVER_SAE, psecuritypriv->akmp)) {
		RTW_FT_INFO("%s : AKM=0x%x\n", __func__, psecuritypriv->akmp);
		goto exit;
	}

	if ((ie->ie_len == 0) ||
		(ie->ie_len >= RTW_FT_MAX_IE_SZ)) {
		ret = - EINVAL;
		goto exit;
	}

	if ((ptr = rtw_get_ie(ie->ie, WLAN_EID_VENDOR_SPECIFIC,
			&len , ie->ie_len)) == NULL) {
		RTW_ERR("FT : no station mac address found in ies\n");
		ret = -EINVAL;
		goto exit;
	}

	if (len != ETH_ALEN) {
		RTW_ERR("FT : invalid station mac length(%u)\n", len);
		ret = -EINVAL;
		goto exit;
	}

	paddr = ptr + 2;
	if ((psta = rtw_get_stainfo(pstapriv, paddr)) == NULL) {
		RTW_ERR("FT : sta "MAC_FMT" not found!\n", MAC_ARG(paddr));
		ret = -EINVAL;
		goto exit;
	}

	RTW_FT_INFO("%s : update sta "MAC_FMT" ie, len=%lu\n",
			__func__, MAC_ARG(paddr), ie->ie_len);
	RTW_FT_DUMP("ie = ", ie->ie, ie->ie_len);

	peer_info = &(psta->ft_peer);
	if ((ptr = rtw_get_ie(ie->ie, EID_WPA2, &len , ie->ie_len)) != NULL) {
		rtw_buf_update(&peer_info->rsn_ie,
			&peer_info->rsn_len, ptr + 2, len);
		RTW_FT_DUMP("rsn_ie = ", peer_info->rsn_ie,
			peer_info->rsn_len);
	}

	if ((ptr = rtw_get_ie(ie->ie, _MDIE_, &len , ie->ie_len)) != NULL) {
		rtw_buf_update(&peer_info->md_ie,
			&peer_info->md_len, ptr + 2, len);
		RTW_FT_DUMP("md_ie = ",
			peer_info->md_ie, peer_info->md_len);
	}

	if ((ptr = rtw_get_ie(ie->ie, _FTIE_, &len , ie->ie_len)) != NULL) {
		rtw_buf_update(&peer_info->ft_ie,
			&peer_info->ft_len, ptr + 2, len);
		RTW_FT_DUMP("ft_ie = ",
			peer_info->ft_ie, peer_info->ft_len);
	}

	if (psta->authalg == WLAN_AUTH_FT)
		issue_asocrsp(padapter, 0, psta, WIFI_REASSOCRSP);
exit:
	return ret;
}

void rtw_ft_update_assocresp_ies(struct net_device *net,
	struct cfg80211_ap_settings *settings)
{
	_adapter *padapter = (_adapter *)rtw_netdev_priv(net);
	struct mlme_priv *pmlmepriv = &(padapter->mlmepriv);
	struct ft_roam_info *pinfo = &(pmlmepriv->ft_roam);
	u8 *ie, *bcn_tail_ies, *assocrsp_ies;
	int ielen, bcn_tail_len, assocrsp_ies_len, ret = 0;

	bcn_tail_ies = (u8 *)settings->beacon.tail;
	bcn_tail_len = (u32)settings->beacon.tail_len;
	assocrsp_ies = (u8 *)settings->beacon.assocresp_ies;
	assocrsp_ies_len = (u32)settings->beacon.assocresp_ies_len;

	if ((bcn_tail_len > 0) &&
		((ie = rtw_get_ie(bcn_tail_ies, _MDIE_,
			&ielen , bcn_tail_len)) != NULL)) {
		pinfo->mdid = *(u16 *)(ie + 2);
		pinfo->ft_cap = *(ie + 4);
		RTW_FT_INFO("%s : mdid = 0x%04x, cap=0x%02x\n",
			__func__, pinfo->mdid, pinfo->ft_cap);
	}

	if ((assocrsp_ies_len > 0) &&
		((ie = rtw_get_ie(assocrsp_ies, _FTIE_,
			&ielen , assocrsp_ies_len)) != NULL)) {
			_rtw_memset(pinfo->updated_ft_ies, 0, RTW_FT_MAX_IE_SZ);
			_rtw_memcpy(pinfo->updated_ft_ies, ie + 2, ielen);
			pinfo->updated_ft_ies_len  = ielen;
			RTW_FT_DUMP("FT : ft ie = ", ie + 2, ielen);
	}

}

void rtw_ft_process_ft_auth_rsp(_adapter *padapter, u8 *pframe, u32 len)
{
	struct sta_priv *pstapriv = &(padapter->stapriv);
	struct sta_info *psta = NULL;
	_irqL irqL;
	/* u8 *ptr; */
	/* u32 plen; */

	/* ptr = pframe + IEEE80211_3ADDR_LEN + _AUTH_IE_OFFSET_; */
	/* plen = len - IEEE80211_3ADDR_LEN - _AUTH_IE_OFFSET_; */

	psta = rtw_get_stainfo(pstapriv, GetAddr1Ptr(pframe));
	if (psta) {
		_enter_critical_bh(&psta->lock, &irqL);
		psta->state &= ~WIFI_FW_AUTH_NULL;
		psta->state |= WIFI_FW_AUTH_SUCCESS;
		psta->expire_to = pstapriv->assoc_to;
		_exit_critical_bh(&psta->lock, &irqL);
	}
}

void rtw_ft_build_assoc_rsp_ies(_adapter *padapter,
	struct sta_info *psta, struct pkt_attrib *pattrib, u8 **pframe)
{
	struct ft_roam_info *prinfo = &(padapter->mlmepriv.ft_roam);
	struct rtw_sta_ft_info_t *peer_info;
	u8 *pie, mdie[3] = {0};
	u32 ielen;

	if (psta == NULL)
		return;

	if (psta->authalg != WLAN_AUTH_FT) {
		*((u16 *)&mdie[0]) = prinfo->mdid;
		mdie[2] = prinfo->ft_cap;
		pie = mdie;
		ielen = 3;

		if (prinfo->mdid > 0) {
		*pframe = rtw_set_ie(((u8 *)*pframe),
			_MDIE_, ielen , pie, &(pattrib->pktlen));
		}

		if (prinfo->updated_ft_ies_len > 0) {
		*pframe = rtw_set_ie(((u8 *)*pframe),
			_FTIE_, prinfo->updated_ft_ies_len,
			prinfo->updated_ft_ies, &(pattrib->pktlen));
		}
	} else {
		peer_info = &(psta->ft_peer);
		if (peer_info->rsn_len > 0) {
			*pframe = rtw_set_ie(((u8 *)*pframe), EID_WPA2,
					peer_info->rsn_len, peer_info->rsn_ie,
					&(pattrib->pktlen));
		}

		if (peer_info->md_len > 0) {
			*pframe = rtw_set_ie(((u8 *)*pframe), _MDIE_,
					peer_info->md_len, peer_info->md_ie,
					&(pattrib->pktlen));
		}

		if (peer_info->ft_len > 0) {
			*pframe = rtw_set_ie(((u8 *)*pframe), _FTIE_,
					peer_info->ft_len, peer_info->ft_ie,
					&(pattrib->pktlen));
		}
	}

}
#endif /* CONFIG_RTW_80211R_AP */
#endif /* CONFIG_IOCTL_CFG80211 && CONFIG_RTW_80211R */
